name: "tinyllama_vllm"

# vLLM backend uses Triton's "generate" extension endpoint:
#   POST /v2/models/tinyllama_vllm/generate
# Request JSON uses:  { "text_input": "...", "parameters": { ... } }
# Response JSON returns: { "text_output": "..." }
backend: "vllm"

# The usage of device is deferred to the vLLM engine.
instance_group [
  {
    count: 1
    kind: KIND_MODEL
  }
]

# Optional: enable vLLM metrics on Triton's /metrics endpoint (vllm:*).
parameters: {
  key: "REPORT_CUSTOM_METRICS"
  value: { string_value: "true" }
}

