name: "tinyllama_hf"
backend: "python"
max_batch_size: 0

input [
  { name: "text_input" data_type: TYPE_STRING dims: [1] }
]

output [
  { name: "text_output" data_type: TYPE_STRING dims: [1] }
]

instance_group [
  { count: 1 kind: KIND_MODEL }
]

